In [2]:
import sqlite3

Connecting to the Database

Connecting to the SQLite Database can be established using the connect() method, passing the name of the database to be accessed as a parameter. If that database does not exist, then it’ll be created. 

sqliteConnection = sqlite3.connect('sql.db')

In [3]:
dbcon=sqlite3.connect('testdatabase.db')#testdatabase is db name which is created automatically in home directory

But what if you want to execute some queries after the connection is being made. For that, a cursor has to be created using the cursor() method on the connection instance, which will execute our SQL queries.

cursor = sqliteConnection.cursor()

Cursor Object

It is an object that is used to make the connection for executing SQL queries. It acts as middleware between SQLite database connection and SQL query. It is created after giving connection to SQLite database.

Syntax: cursor_object=connection_object.execute(“sql query”);

In [4]:
cur=dbcon.cursor()#cursor object is creted

In [4]:
cur.execute('create table student(rollno int primary key,name text,marks int)')#create student table into testdatabase using execute method

OperationalError: table student already exists

In [6]:
cur.execute('insert into student(rollno,name,marks)values(1,"abc",78)')

In [9]:
result=cur.execute('select * from student')
for res in result:
    print(res)

(1, 'abc', 78)

In [10]:
cur.execute('insert into student(rollno,name,marks)values(2,"xyz",45)')

In [11]:
cur.execute('insert into student(rollno,name,marks)values(3,"tre",56)')

In [12]:
cur.execute('insert into student(rollno,name,marks)values(4,"ranu",567)')

In [13]:
cur.execute('insert into student(rollno,name,marks)values(5,"minu",38)')

In [14]:
result=cur.execute('select * from student')
for res in result:
    print(res)

(1, 'abc', 78)
(2, 'xyz', 45)
(3, 'tre', 56)
(4, 'ranu', 567)
(5, 'minu', 38)

In [15]:
result=cur.execute('select rollno from student')
for res in result:
    print(res)

(1,)
(2,)
(3,)
(4,)
(5,)

In [16]:
result=cur.execute('select name from student')
for res in result:
    print(res)

('abc',)
('xyz',)
('tre',)
('ranu',)
('minu',)

In [17]:
result=cur.execute('select marks from student')
for res in result:
    print(res)

(78,)
(45,)
(56,)
(567,)
(38,)

In [19]:
result=cur.execute('select rollno, name from student')
for res in result:
    print(res)

(1, 'abc')
(2, 'xyz')
(3, 'tre')
(4, 'ranu')
(5, 'minu')

In [20]:
result=cur.execute('select name ,marks from student')
for res in result:
    print(res)

('abc', 78)
('xyz', 45)
('tre', 56)
('ranu', 567)
('minu', 38)

In [21]:
result=cur.execute('select rollno,name, marks from student')
for res in result:
    print(res)

(1, 'abc', 78)
(2, 'xyz', 45)
(3, 'tre', 56)
(4, 'ranu', 567)
(5, 'minu', 38)

In [23]:
result=cur.execute('select * from student where rollno=5')
for res in result:
    print(res)

(5, 'minu', 38)

In [26]:
result=cur.execute('select * from student where name="ranu"')
for res in result:
    print(res)

(4, 'ranu', 567)

In [27]:
result=cur.execute('select name from student where rollno=5')
for res in result:
    print(res)

('minu',)

In [28]:
result=cur.execute('select name,marks from student where rollno=4')
for res in result:
    print(res)

('ranu', 567)

In [24]:
result=cur.execute('select * from student where name="minu"')
result.fetchone()#fetchone is used for fetch selected attributes from database

(5, 'minu', 38)

In [25]:
result=cur.execute('select * from student ')
result.fetchall()#fetchall is used for fetch all attributes from database

[(1, 'abc', 78),
 (2, 'xyz', 45),
 (3, 'tre', 56),
 (4, 'ranu', 567),
 (5, 'minu', 38)]

In [29]:
cur.execute('insert into student(rollno,name,marks)values(6,"sonu",78)')

In [43]:
result=cur.execute('select * from student ')
result.fetchall()

[(1, 'abc', 78),
 (2, 'xyz', 45),
 (3, 'tre', 56),
 (4, 'ranu', 567),
 (5, 'minu', 38),
 (6, 'sonu', 78)]

In [33]:
result= cur.execute('select * from student limit 3 ')
result.fetchall()

[(1, 'abc', 78), (2, 'xyz', 45), (3, 'tre', 56)]

In [34]:
result=cur.execute('select * from student limit 5 ')#limit command is used for a limited  data selection
result.fetchall()

[(1, 'abc', 78),
 (2, 'xyz', 45),
 (3, 'tre', 56),
 (4, 'ranu', 567),
 (5, 'minu', 38)]

In [35]:
result=cur.execute('select * from student order by name asc')#order by used for display inorder
result.fetchall()

[(1, 'abc', 78),
 (5, 'minu', 38),
 (4, 'ranu', 567),
 (6, 'sonu', 78),
 (3, 'tre', 56),
 (2, 'xyz', 45)]

In [36]:
cur.execute('select * from student order by name desc ')
result.fetchall()

[(2, 'xyz', 45),
 (3, 'tre', 56),
 (6, 'sonu', 78),
 (4, 'ranu', 567),
 (5, 'minu', 38),
 (1, 'abc', 78)]

In [37]:
result=cur.execute('select * from student where rollno in (1,2,3) ')
result.fetchall()

[(1, 'abc', 78), (2, 'xyz', 45), (3, 'tre', 56)]

In [44]:
result=cur.execute('select * from student where name in ("ranu","sonu","minu") ')
result.fetchall()

[(4, 'ranu', 567), (5, 'minu', 38), (6, 'sonu', 78)]

In [45]:
result=cur.execute('select * from student where marks between 40 and 70')
result.fetchall()

[(2, 'xyz', 45), (3, 'tre', 56)]

In [46]:
result=cur.execute('select * from student where marks>40 and 40 and marks<70')
result.fetchall()

[(2, 'xyz', 45), (3, 'tre', 56)]

#

# STUDENT DATABASE

In [110]:
import sqlite3

In [111]:
db=sqlite3.connect("student_database.db")

In [112]:
cur=db.cursor()#cursor object is creted

In [11]:
cur.execute('create table student(rollno int primary key,name text,marks int)')

commit cammand

a commit is the updating of a record in a database. In the context of a database transaction, a commit refers to the saving of data permanently after a set of tentative changes. A commit ends a transaction within a relational database and allows all other users to see the changes

after every insert cammand we have to do commit for permanent saving and retriving later

In [18]:
cur.execute('insert into student(rollno,name,marks)values(3,"amyara",45)')
db.commit()

In [12]:
cur.execute('insert into student(rollno,name,marks)values(2,"xyz",45)')
db.commit()

In [13]:
cur.execute('insert into student(rollno,name,marks)values(1,"myara",45)')
db.commit()

In [15]:
cur.execute('insert into student(rollno,name,marks)values(4,"meenu",45)')
db.commit()

In [16]:
cur.execute('insert into student(rollno,name,marks)values(5,"setu",45)')
db.commit()

In [17]:
cur.execute('insert into student(rollno,name,marks)values(6,"myara",44)')
db.commit()

In [19]:
result=cur.execute('select * from student')
result.fetchall()

[(2, 'xyz', 45),
 (1, 'myara', 45),
 (4, 'meenu', 45),
 (5, 'setu', 45),
 (6, 'myara', 44),
 (3, 'amyara', 45)]

In [20]:
cur.execute('insert into student(rollno,name,marks)values(7,"my",56)')
db.commit()
print(cur.rowcount ,"record(s) inserted")

1 record(s) inserted

In [ ]:
result=cur.execute('select * from student')
result.fetchall()

# EMPLOYEE TABLE

In [21]:
import sqlite3

WANT TO STORE DATABASE IN PERTICULAE LOCATION

In [22]:
db=sqlite3.connect("E:\python\mysqlite_database\empdatabase.db")

In [38]:
cur=db.cursor()#cursor object is creted

In [39]:
cur.execute('create table employee(id int primary key,name text,age int)')

In [40]:
cur.execute('insert into employee(id,name,age)values(1,"anita",33)')
db.commit()
print(cur.rowcount ,"record(s) inserted")

1 record(s) inserted

In [41]:
cur.execute('insert into employee(id,name,age)values(2,"amit",23)')
db.commit()

In [42]:
cur.execute('insert into employee(id,name,age)values(3,"raginee",32)')
db.commit()

In [43]:
res=cur.execute('select * from employee')
for i in res:
    print(i)

(1, 'anita', 33)
(2, 'amit', 23)
(3, 'raginee', 32)

In [44]:
cur.execute('insert into employee(id,name,age)values(4,"ritu",63), (5,"madhu",43)')
db.commit()
print(cur.rowcount ,"record(s) inserted")

2 record(s) inserted

In [45]:
res=cur.execute('select * from employee')
res.fetchall()

[(1, 'anita', 33),
 (2, 'amit', 23),
 (3, 'raginee', 32),
 (4, 'ritu', 63),
 (5, 'madhu', 43)]

In [46]:
res=cur.execute('select * from employee where id=5')
res.fetchone()

(5, 'madhu', 43)

In [47]:
res=cur.execute('select * from employee limit 3')
res.fetchall()

[(1, 'anita', 33), (2, 'amit', 23), (3, 'raginee', 32)]

In [48]:
res=cur.execute('select * from employee order by name desc ')
res.fetchall()

[(4, 'ritu', 63),
 (3, 'raginee', 32),
 (5, 'madhu', 43),
 (1, 'anita', 33),
 (2, 'amit', 23)]

In [50]:
res=cur.execute('select * from employee order by name asc ')
res.fetchall()

[(2, 'amit', 23),
 (1, 'anita', 33),
 (5, 'madhu', 43),
 (3, 'raginee', 32),
 (4, 'ritu', 63)]

In [51]:
res=cur.execute('select * from employee where age between 30 and 40 ')
res.fetchall()

[(1, 'anita', 33), (3, 'raginee', 32)]

In [53]:
res=cur.execute('select * from employee where age >30 and age< 40  ')
res.fetchall()

[(1, 'anita', 33), (3, 'raginee', 32)]

In [54]:
res=cur.execute('select * from employee where id in(1,2,3) ')
res.fetchall()

[(1, 'anita', 33), (2, 'amit', 23), (3, 'raginee', 32)]

In [56]:
res=cur.execute('select * from employee where age in(33,23,43) ')
res.fetchall()

[(1, 'anita', 33), (2, 'amit', 23), (5, 'madhu', 43)]

In [58]:
res=cur.execute('select * from employee where id =5 ')
res.fetchall()

[(5, 'madhu', 43)]

In [62]:
res=cur.execute('select id ,age from employee where name="madhu" ')
res.fetchall()

[(5, 43)]

AND OR operater

In [63]:
res=cur.execute('select * from employee where id =5 and name="madhu" ')
res.fetchall()

[(5, 'madhu', 43)]

In [64]:
res=cur.execute('select * from employee where where id =4 and name="madhu" ')# AND operater both condition is true is must
res.fetchall()

OperationalError: near "where": syntax error

In [66]:
res=cur.execute('select * from employee where id =5 or name="madhu" ')
res.fetchall()

[(5, 'madhu', 43)]

In [69]:
res=cur.execute('select * from employee  where id =4 or name="madhu" ')# OR operater any  condition is true 
res.fetchall()

[(4, 'ritu', 63), (5, 'madhu', 43)]

AGGRIGATE FUNCTION

MIN - find minimum 

MAX - find maximum

SUM -find sum

AVG -find avg

COUNT - count no. of row

In [71]:
res=cur.execute('select min(age) from employee  ')
res.fetchone()

(23,)

In [72]:
res=cur.execute('select max(age) from employee  ')
res.fetchone()

(63,)

In [74]:
res=cur.execute('select avg(age) from employee  ')
res.fetchone()

(38.8,)

In [75]:
res=cur.execute('select sum(age) from employee  ')
res.fetchone()

(194,)

In [76]:
res=cur.execute('select count(age) from employee  ')
res.fetchone()

(5,)

NULL operater- if any value is missing

In [81]:
res=cur.execute('select * from employee  where name is null')
res.fetchall()#there is no null value

[]

In [83]:
res=cur.execute('select * from employee  where name is not null')#not null means not missing
res.fetchall()

[(1, 'anita', 33),
 (2, 'amit', 23),
 (3, 'raginee', 32),
 (4, 'ritu', 63),
 (5, 'madhu', 43)]

In [90]:
cur.execute('insert into employee(id,name,age)values(6,null,33)')
db.commit()

In [91]:
res=cur.execute('select * from employee  where name is null')
res.fetchall()#there is one null value

[(6, None, 33)]

LIKE OPERATER- in which % means any character, _(underscose )means single character

In [93]:
res=cur.execute('select * from employee  where name like "m%"')
res.fetchall()#there is one null value

[(5, 'madhu', 43)]

In [94]:
res=cur.execute('select * from employee  where name like "%a%"')
res.fetchall()

[(1, 'anita', 33), (2, 'amit', 23), (3, 'raginee', 32), (5, 'madhu', 43)]

In [95]:
res=cur.execute('select * from employee  where name like "%u"')
res.fetchall()

[(4, 'ritu', 63), (5, 'madhu', 43)]

In [97]:
res=cur.execute('select * from employee  where name like "_a%"')
res.fetchall()

[(3, 'raginee', 32), (5, 'madhu', 43)]

In [98]:
res=cur.execute('select * from employee  where name like "____"')#4 under score means four character name is fetch
res.fetchall()

[(2, 'amit', 23), (4, 'ritu', 63)]

NOT IN operater

In [99]:
res=cur.execute('select * from employee  where age not in (33)')#reverse of in operater
res.fetchall()

[(2, 'amit', 23), (3, 'raginee', 32), (4, 'ritu', 63), (5, 'madhu', 43)]

In [100]:
res=cur.execute('select * from employee  where age in (33)')
res.fetchall()

[(1, 'anita', 33), (6, None, 33)]

UPDATE QUERY -use for edit attributes

DELETE query -use for delete perticuler row

DROP QUERY - delete whole table

In [101]:
sql="update employee set age=60 where id=4"
cur.execute(sql)
db.commit()

In [102]:
res=cur.execute('select * from employee ')
res.fetchall()

[(1, 'anita', 33),
 (2, 'amit', 23),
 (3, 'raginee', 32),
 (4, 'ritu', 60),
 (5, 'madhu', 43),
 (6, None, 33)]

In [103]:

cur.execute("update employee set age=65 where name='ritu'")
db.commit()

In [104]:
res=cur.execute('select * from employee ')
res.fetchall()

[(1, 'anita', 33),
 (2, 'amit', 23),
 (3, 'raginee', 32),
 (4, 'ritu', 65),
 (5, 'madhu', 43),
 (6, None, 33)]

In [106]:
cur.execute("update employee set age=50 where id in(3,5)")
db.commit()
res=cur.execute('select * from employee ')
res.fetchall()

[(1, 'anita', 33),
 (2, 'amit', 23),
 (3, 'raginee', 50),
 (4, 'ritu', 65),
 (5, 'madhu', 50),
 (6, None, 33)]

In [109]:
cur.execute("delete from employee where id=6")
db.commit()
res=cur.execute('select * from employee ')
res.fetchall()

[(1, 'anita', 33),
 (2, 'amit', 23),
 (3, 'raginee', 50),
 (4, 'ritu', 65),
 (5, 'madhu', 50)]

# INSERTING RECORDS FROM CSV(cama sepereted value)file into table

In [37]:
import sqlite3

In [38]:
db=sqlite3.connect("E:\python\mysqlite_database\score.db")#database created in given location

In [39]:
cur=db.cursor()

In [42]:
cur.execute('create table score1(gender text,id int primary key,score int)')

In [43]:
# if our file is in any drive then need to give path or upload into jupyter notebook
with open("score_file.csv",'r') as file: #file is variable 
    total_record=0
    for row in file:
        cur.execute('insert into score values(?,?,?)' ,row.split(',')) #? used for inserting dynamic value
        db.commit()
        total_record+=1
print(total_record,"record inserted")

IntegrityError: UNIQUE constraint failed: score.id

In [44]:
result=cur.execute('select * from score')
for res in result:
    print(res)

('male', 101, 23)
('male', 102, 45)
('female', 103, 32)
('male', 105, 98)
('female', 106, 23)

In [7]:
result=cur.execute('select * from score where id=102')
for res in result:
    print(res)

('male', 102, 45)

# IF OUR CSV FILE IS OUT OF JUPYTER NOTE BOOK THEN WE HAVE TO GIVE THE PATH OR UPLOAD IT INTO JUPYTER

In [46]:
import sqlite3

In [47]:
con=sqlite3.connect("E:\python\mysqlite_database\person.db")

In [48]:
cur=con.cursor()

In [68]:
cur.execute('create table person9(id int primary key,name text,age int)')

In [69]:
# if our file is in any drive then need to give path or upload into jupyter notebook
with open("myfile1.csv",'r') as file: #file is variable 
    total_record=0
    for row in file:
        cur.execute('insert into person9 values(?,?,?)' , row.split(',')) #? used for inserting dynamic value
        con.commit()
        total_record+=1
print(total_record,"record inserted")

4 record inserted

In [70]:
result=cur.execute('select * from person7')
for res in result:
    print(res)

('id', 'name', 'age\n')
(1, 'ranu', 23)
(2, 'minu', 45)
(3, 'sonu', 23)

# UNIQUE AND NOT NULL

UNIQUE -enter only unique value ,no duplicates value


NOT NULL- no blank value can be inserted in table

In [2]:
import sqlite3

In [4]:
con=sqlite3.connect("E:\python\mysqlite_database\constraint.db")

In [5]:
cur=con.cursor()

In [12]:
cur.execute("create table employees(id int primary key,name text,phone int unique,address text not null)")

In [19]:
cur.execute("insert into employees values(101,'ranu',9406514131,'raipur')")
db.commit()

IntegrityError: UNIQUE constraint failed: employees.phone

In [15]:
cur.execute("insert into employees values(102,'ranu',9406514131,'raipur')")#we have enter unique phone no

IntegrityError: UNIQUE constraint failed: employees.phone

In [16]:
cur.execute("insert into employees values(103,'sonu',9423455531,'bhilai')")

In [18]:
cur.execute("insert into employees values(104,'setu',8776514131,'')")

In [22]:
cur.execute("insert into employees values(105,'ranu',9406785661,'raighar')")
con.commit()

IntegrityError: UNIQUE constraint failed: employees.id

In [23]:
cur.execute("insert into employees values(108,'sonu',9423455451,null)")#have to fill the value of add bcz that is not null

IntegrityError: NOT NULL constraint failed: employees.address

In [24]:
cur.execute("insert into employees values(109,'myra',9478855531,'raipur')")

In [27]:
res=cur.execute('select * from employees')
res.fetchall()

[(101, 'ranu', 9406514131, 'raipur'),
 (103, 'sonu', 9423455531, 'bhilai'),
 (104, 'setu', 8776514131, ''),
 (105, 'ranu', 940678831, 'raighar'),
 (109, 'myra', 9478855531, 'raipur')]

# EMPLOYEE DATABASE WITH DB AND PYTHON PROGRAMMING

In [28]:
import sqlite3

In [30]:
con=sqlite3.connect("E:\python\mysqlite_database\emp_database.db")

In [34]:
def sql_table (con):
    cur=con.cursor()
    cur.execute("create table employee(id int primary key,name text,address text)")
    con.commit()

In [35]:
sql_table(con)#calling function

In [40]:
cur=con.cursor()
cur.execute("insert into employee values(102,'raginee','raipur')")
con.commit()

In [42]:
res=cur.execute("select* from employee")
res.fetchall()

[(102, 'raginee', 'raipur')]

# we can also pass value/argumensts to a insert statement in the execute method. you can use the ? as a placeholder for each value the syntax of the insert is like be following

cur.execute('''insert into employee (id,name,address) values (?,?,?) , entities''')


entities=(103,'sonu','bhilai')

In [43]:
def sql_insert (con,entities):
    cur=con.cursor()
    cur.execute('insert into employee (id,name,address) values (?,?,?)' , entities)
    con.commit()

In [44]:
entities=(103,'sonu','bhilai')

In [45]:
sql_insert(con,entities)#function calling

In [46]:
entities=(104,'meenu','bhilai')

In [48]:
sql_insert(con,entities)

In [49]:
res=cur.execute("select* from employee")
res.fetchall()

[(102, 'raginee', 'raipur'), (103, 'sonu', 'bhilai'), (104, 'meenu', 'bhilai')]

In [50]:
entities=(105,'chiku','korba')
sql_insert(con,entities)
entities=(106,'madhu','indore')
sql_insert(con,entities)

In [51]:
res=cur.execute("select* from employee")
res.fetchall()

[(102, 'raginee', 'raipur'),
 (103, 'sonu', 'bhilai'),
 (104, 'meenu', 'bhilai'),
 (105, 'chiku', 'korba'),
 (106, 'madhu', 'indore')]

In [61]:
def sql_update(con):
    cur=con.cursor()
    cur.execute('update employee set address= "mumbai" where id=104 ')
    con.commit()

In [62]:
 sql_update(con)

In [63]:
res=cur.execute("select* from employee")
res.fetchall()

[(102, 'raginee', 'raipur'),
 (103, 'sonu', 'bhilai'),
 (104, 'meenu', 'mumbai'),
 (105, 'chiku', 'korba'),
 (106, 'madhu', 'indore')]

In [64]:
res=cur.execute("select name,address from employee where id>103")
res.fetchall()

[('meenu', 'mumbai'), ('chiku', 'korba'), ('madhu', 'indore')]

In [66]:
res=cur.execute("select count(id) from employee")
res.fetchall()

[(5,)]

In [67]:
res=cur.execute("select distinct(address) from employee")
res.fetchall()

[('raipur',), ('bhilai',), ('mumbai',), ('korba',), ('indore',)]

In [68]:
res=cur.execute("select count(distinct(address))from employee")
res.fetchall()

[(5,)]

# SQL EXECUTEMANY BULKENTRY

WE CAN USE EXECUTEMANY FOR INSERT MULTIPLE ROWS AT ONES

In [71]:
entities=[(200,'myra','raipur'),(107,'heer','aishwarya'),(108,'alok','ujjain'),(109,'deba','odisa'),]

In [72]:
cur.executemany('insert into employee (id,name,address) values (?,?,?)' , entities)

In [73]:
res=cur.execute("select *from employee")
res.fetchall()

[(102, 'raginee', 'raipur'),
 (103, 'sonu', 'bhilai'),
 (104, 'meenu', 'mumbai'),
 (105, 'chiku', 'korba'),
 (106, 'madhu', 'indore'),
 (200, 'myra', 'raipur'),
 (107, 'heer', 'aishwarya'),
 (108, 'alok', 'ujjain'),
 (109, 'deba', 'odisa')]

# REFRENCIAL INTIGRITY (Referential integrity refers to the relationship between tables. Because each table in a database must have a primary key, this primary key can appear in other tables because of its relationship to data within those tables. When a primary key from one table appears in another table, it is called a foreign key .
)

In [2]:
import sqlite3

In [3]:
con1=sqlite3.connect("E:\python\mysqlite_database\student_course.db")

In [4]:
cur1=con1.cursor()

In [5]:
cur1.execute('create table course(courseid int primary key,coursename text, duration int) ')

In [6]:
#here courseid is foreign key of couse table and the value of courseid in student table must be available in course table

cur1.execute('create table student(rollno int primary key, name text,age int,courseid int,foreign key(courseid) references course(courseid)) ')

In [7]:
cur1.execute("insert into course values(78,'data science',12),(16,'python',3),(100,'database',5)")
print(cur1.rowcount,"records(s) is inserted")
con1.commit()

3 records(s) is inserted

In [8]:
cur1.execute("insert into student values(1,'raginee',12,78),(2,'bhupendra',30,100),(3,'rahul',50,16),(4,'piyu',55,78)")
print(cur1.rowcount,"records(s) is inserted")
con1.commit()

4 records(s) is inserted

In [11]:
result=cur1.execute('select * from course')
for res in result:
    print(res)

(78, 'data science', 12)
(16, 'python', 3)
(100, 'database', 5)

In [16]:
result=cur1.execute('select * from student')
result.fetchall()

[(1, 'raginee', 12, 78),
 (2, 'bhupendra', 30, 100),
 (3, 'rahul', 50, 16),
 (4, 'piyu', 55, 78)]

In [17]:
result=cur1.execute("select courseid from course where coursename='data science'")
result.fetchall()

[(78,)]

# SUBQUERY

Query within the query (outer query and inner query)

In [20]:
#how many student takeing datascience course
result=cur1.execute("select * from student where courseid = (select courseid from course where coursename='data science')")
result.fetchall()

[(1, 'raginee', 12, 78), (4, 'piyu', 55, 78)]

In [22]:
result=cur1.execute("select name from student where courseid = (select courseid from course where coursename='python')")
result.fetchall()

[('rahul',)]

# JOIN

You can combine rows from two or more tables, based on a related column between them, by using a JOIN statement.

INNER JOIN -return all record from both table which are comman

LEFT JOIN - return all record from left table and comman record from both table

LEFT JOIN - return all record from right table and comman record from both table

FULL OUTER JOIN-return all record from both table

In [ ]:
cur1.execute("insert into course values(30,'java',13),(12,'c',33)")
print(cur1.rowc

In [16]:
ount,"records(s) is inserted")
con1.commit()

2 records(s) is inserted

In [18]:
cur1.execute("insert into student values(5,'rag',23,76),(6,'bhup',36,34)")
print(cur1.rowcount,"records(s) is inserted")
con1.commit()

2 records(s) is inserted

In [17]:
result=cur1.execute('select * from course')
result.fetchall()

[(78, 'data science', 12),
 (16, 'python', 3),
 (100, 'database', 5),
 (30, 'java', 13),
 (12, 'c', 33)]

In [19]:
result=cur1.execute('select * from student')
result.fetchall()

[(1, 'raginee', 12, 78),
 (2, 'bhupendra', 30, 100),
 (3, 'rahul', 50, 16),
 (4, 'piyu', 55, 78),
 (5, 'rag', 23, 76),
 (6, 'bhup', 36, 34)]

In [21]:
sql= "SELECT student.rollno ,student.name , course.courseid,course.coursename from student INNER JOIN course ON student.courseid = course.courseid"
result=cur1.execute(sql)
for row in result:
    print(row)

(1, 'raginee', 78, 'data science')
(2, 'bhupendra', 100, 'database')
(3, 'rahul', 16, 'python')
(4, 'piyu', 78, 'data science')

In [27]:
sql= "SELECT student.rollno ,student.name , course.courseid,course.coursename FROM course LEFT JOIN student ON student.courseid = course.courseid"
result=cur1.execute(sql) #here we assume course table is left 
for row in result:
    print(row)

(1, 'raginee', 78, 'data science')
(4, 'piyu', 78, 'data science')
(3, 'rahul', 16, 'python')
(2, 'bhupendra', 100, 'database')
(None, None, 30, 'java')
(None, None, 12, 'c')

In [28]:
sql= "SELECT student.rollno ,student.name , course.courseid,course.coursename FROM student LEFT JOIN course ON student.courseid = course.courseid"
result=cur1.execute(sql)#here we assume student table is left  JUST LIKE RIGHT JOIN
for row in result:
    print(row)

(1, 'raginee', 78, 'data science')
(2, 'bhupendra', 100, 'database')
(3, 'rahul', 16, 'python')
(4, 'piyu', 78, 'data science')
(5, 'rag', None, None)
(6, 'bhup', None, None)

# RIGHT JOIN AND FULL OUTER JOIN IS NOT SUPPORTED IN SQLITE